assignment_02/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    down
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       6250;
    }
    right
    {
        type            patch;
        nFaces          30;
        startFace       6350;
    }
    up
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       6380;
    }
    left
    {
        type            patch;
        nFaces          30;
        startFace       6480;
    }
    cylinder
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          40;
        startFace       6510;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          6400;
        startFace       6550;
    }
)

// ************************************************************************* //
